ABOSTM/Arduino_Core_STM32/boards.txt
# Generic F407VG
GenF4.menu.pnum.Generic_F407VG=Generic F407VG
GenF4.menu.pnum.Generic_F407VG.upload.maximum_size=1048576
GenF4.menu.pnum.Generic_F407VG.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F407VG.build.board=GENERIC_F407VG
GenF4.menu.pnum.Generic_F407VG.build.product_line=STM32F407xx
GenF4.menu.pnum.Generic_F407VG.build.variant=STM32F4xx/Generic_F4x7Vx

# Generic F407VE
GenF4.menu.pnum.Generic_F407VE=Generic F407VE
GenF4.menu.pnum.Generic_F407VE.upload.maximum_size=524288
GenF4.menu.pnum.Generic_F407VE.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F407VE.build.board=GENERIC_F407VE
GenF4.menu.pnum.Generic_F407VE.build.product_line=STM32F407xx
GenF4.menu.pnum.Generic_F407VE.build.variant=STM32F4xx/Generic_F4x7Vx

# Generic F405RG
GenF4.menu.pnum.Generic_F405RG=Generic F405RG
GenF4.menu.pnum.Generic_F405RG.upload.maximum_size=1048576
GenF4.menu.pnum.Generic_F405RG.upload.maximum_data_size=131072
GenF4.menu.pnum.Generic_F405RG.build.board=GENERIC_F405RG
GenF4.menu.pnum.Generic_F405RG.build.product_line=STM32F405xx
GenF4.menu.pnum.Generic_F405RG.build.variant=STM32F4xx/Generic_F4x5RG

# Generic F401RE
GenF4.menu.pnum.Generic_F401RE=Generic F401RE
GenF4.menu.pnum.Generic_F401RE.upload.maximum_size=524288
GenF4.menu.pnum.Generic_F401RE.upload.maximum_data_size=98304
GenF4.menu.pnum.Generic_F401RE.build.board=GENERIC_F401RE
GenF4.menu.pnum.Generic_F401RE.build.product_line=STM32F401xE
GenF4.menu.pnum.Generic_F401RE.build.variant=STM32F4xx/Generic_F401Rx

# Generic F401RD
GenF4.menu.pnum.Generic_F401RD=Generic F401RD
GenF4.menu.pnum.Generic_F401RD.upload.maximum_size=393216
GenF4.menu.pnum.Generic_F401RD.upload.maximum_data_size=98304
GenF4.menu.pnum.Generic_F401RD.build.board=GENERIC_F401RD
GenF4.menu.pnum.Generic_F401RD.build.product_line=STM32F401xE
GenF4.menu.pnum.Generic_F401RD.build.variant=STM32F4xx/Generic_F401Rx

# Generic F401RC
GenF4.menu.pnum.Generic_F401RC=Generic F401RC
GenF4.menu.pnum.Generic_F401RC.upload.maximum_size=262144
GenF4.menu.pnum.Generic_F401RC.upload.maximum_data_size=65536
GenF4.menu.pnum.Generic_F401RC.build.board=GENERIC_F401RC
GenF4.menu.pnum.Generic_F401RC.build.product_line=STM32F401xC
GenF4.menu.pnum.Generic_F401RC.build.variant=STM32F4xx/Generic_F401Rx

# Generic F401RB
GenF4.menu.pnum.Generic_F401RB=Generic F401RB
GenF4.menu.pnum.Generic_F401RB.upload.maximum_size=131072
GenF4.menu.pnum.Generic_F401RB.upload.maximum_data_size=65536
GenF4.menu.pnum.Generic_F401RB.build.board=GENERIC_F401RB
GenF4.menu.pnum.Generic_F401RB.build.product_line=STM32F401xC
GenF4.menu.pnum.Generic_F401RB.build.variant=STM32F4xx/Generic_F401Rx

# Generic F401CE
GenF4.menu.pnum.Generic_F401CE=Generic F401CE
GenF4.menu.pnum.Generic_F401CE.upload.maximum_size=524288
GenF4.menu.pnum.Generic_F401CE.upload.maximum_data_size=98304
GenF4.menu.pnum.Generic_F401CE.build.board=GENERIC_F401CE
GenF4.menu.pnum.Generic_F401CE.build.product_line=STM32F401xE
GenF4.menu.pnum.Generic_F401CE.build.variant=STM32F4xx/Generic_F401Cx

# Generic F401CD
GenF4.menu.pnum.Generic_F401CD=Generic F401CD
GenF4.menu.pnum.Generic_F401CD.upload.maximum_size=393216
GenF4.menu.pnum.Generic_F401CD.upload.maximum_data_size=98304
GenF4.menu.pnum.Generic_F401CD.build.board=GENERIC_F401CD
GenF4.menu.pnum.Generic_F401CD.build.product_line=STM32F401xE
GenF4.menu.pnum.Generic_F401CD.build.variant=STM32F4xx/Generic_F401Cx

# Generic F401CC
GenF4.menu.pnum.Generic_F401CC=Generic F401CC
GenF4.menu.pnum.Generic_F401CC.upload.maximum_size=262144
GenF4.menu.pnum.Generic_F401CC.upload.maximum_data_size=65536
GenF4.menu.pnum.Generic_F401CC.build.board=GENERIC_F401CC
GenF4.menu.pnum.Generic_F401CC.build.product_line=STM32F401xC
GenF4.menu.pnum.Generic_F401CC.build.variant=STM32F4xx/Generic_F401Cx

# Generic F401CB
GenF4.menu.pnum.Generic_F401CB=Generic F401CB
GenF4.menu.pnum.Generic_F401CB.upload.maximum_size=131072
GenF4.menu.pnum.Generic_F401CB.upload.maximum_data_size=65536
GenF4.menu.pnum.Generic_F401CB.build.board=GENERIC_F401CB
GenF4.menu.pnum.Generic_F401CB.build.product_line=STM32F401xC
GenF4.menu.pnum.Generic_F401CB.build.variant=STM32F4xx/Generic_F401Cx

# Upload menu
GenF4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF4.menu.upload_method.swdMethod.upload.protocol=0
GenF4.menu.upload_method.swdMethod.upload.options=-g
GenF4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF4.menu.upload_method.serialMethod.upload.protocol=1
GenF4.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenF4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF4.menu.upload_method.dfuMethod.upload.protocol=2
GenF4.menu.upload_method.dfuMethod.upload.options=-g
GenF4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenF4.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenF4.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenF4.menu.upload_method.bmpMethod.upload.tool=bmp_upload

GenF4.menu.upload_method.hidMethod=HID Bootloader 2.2
GenF4.menu.upload_method.hidMethod.upload.protocol=hid22
GenF4.menu.upload_method.hidMethod.upload.tool=hid_upload
GenF4.menu.upload_method.hidMethod.build.flash_offset=0x4000
GenF4.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}

###############################
# Generic G0
GenG0.name=Generic STM32G0 series

GenG0.build.core=arduino
GenG0.build.board=GenG0
GenG0.build.mcu=cortex-m0plus
GenG0.build.series=STM32G0xx
GenG0.build.cmsis_lib_gcc=arm_cortexM0l_math
GenG0.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0

# Generic G030K6
GenG0.menu.pnum.GENERIC_G030K6=Generic G030K6
GenG0.menu.pnum.GENERIC_G030K6.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G030K6.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G030K6.build.board=GENERIC_G030K6
GenG0.menu.pnum.GENERIC_G030K6.build.product_line=STM32G030xx
GenG0.menu.pnum.GENERIC_G030K6.build.variant=STM32G0xx/Generic_G030Kx

# Generic G030K8
GenG0.menu.pnum.GENERIC_G030K8=Generic G030K8
GenG0.menu.pnum.GENERIC_G030K8.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G030K8.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G030K8.build.board=GENERIC_G030K8
GenG0.menu.pnum.GENERIC_G030K8.build.product_line=STM32G030xx
GenG0.menu.pnum.GENERIC_G030K8.build.variant=STM32G0xx/Generic_G030Kx

# Aurora One G030K8
GenG0.menu.pnum.AURORA_ONE=Aurora One
GenG0.menu.pnum.AURORA_ONE.upload.maximum_size=65536
GenG0.menu.pnum.AURORA_ONE.upload.maximum_data_size=16384
GenG0.menu.pnum.AURORA_ONE.build.board=AURORA_ONE
GenG0.menu.pnum.AURORA_ONE.build.product_line=STM32G030xx
GenG0.menu.pnum.AURORA_ONE.build.variant=STM32G0xx/Generic_G030Kx

# Generic G031J4
GenG0.menu.pnum.GENERIC_G031J4=Generic G031J4
GenG0.menu.pnum.GENERIC_G031J4.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031J4.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031J4.build.board=GENERIC_G031J4
GenG0.menu.pnum.GENERIC_G031J4.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031J4.build.variant=STM32G0xx/Generic_G031Jx

# Generic G031J6
GenG0.menu.pnum.GENERIC_G031J6=Generic G031J6
GenG0.menu.pnum.GENERIC_G031J6.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031J6.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031J6.build.board=GENERIC_G031J6
GenG0.menu.pnum.GENERIC_G031J6.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031J6.build.variant=STM32G0xx/Generic_G031Jx

# Generic G031K4
GenG0.menu.pnum.GENERIC_G031K4=Generic G031K4
GenG0.menu.pnum.GENERIC_G031K4.upload.maximum_size=16384
GenG0.menu.pnum.GENERIC_G031K4.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K4.build.board=GENERIC_G031K4
GenG0.menu.pnum.GENERIC_G031K4.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K4.build.variant=STM32G0xx/Generic_G031Kx

# Generic G031K6
GenG0.menu.pnum.GENERIC_G031K6=Generic G031K6
GenG0.menu.pnum.GENERIC_G031K6.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G031K6.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K6.build.board=GENERIC_G031K6
GenG0.menu.pnum.GENERIC_G031K6.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K6.build.variant=STM32G0xx/Generic_G031Kx

