ABOSTM/Arduino_Core_STM32/boards.txt
# Generic G031K8
GenG0.menu.pnum.GENERIC_G031K8=Generic G031K8
GenG0.menu.pnum.GENERIC_G031K8.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G031K8.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K8.build.board=GENERIC_G031K8
GenG0.menu.pnum.GENERIC_G031K8.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K8.build.variant=STM32G0xx/Generic_G031Kx

# Generic G071R6
GenG0.menu.pnum.GENERIC_G071R6=Generic G071R6
GenG0.menu.pnum.GENERIC_G071R6.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G071R6.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071R6.build.board=GENERIC_G071R6
GenG0.menu.pnum.GENERIC_G071R6.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071R6.build.variant=STM32G0xx/Generic_G071Rx

# Generic G071R8
GenG0.menu.pnum.GENERIC_G071R8=Generic G071R8
GenG0.menu.pnum.GENERIC_G071R8.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071R8.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071R8.build.board=GENERIC_G071R8
GenG0.menu.pnum.GENERIC_G071R8.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071R8.build.variant=STM32G0xx/Generic_G071Rx

# Generic G071RB
GenG0.menu.pnum.GENERIC_G071RB=Generic G071RB
GenG0.menu.pnum.GENERIC_G071RB.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071RB.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071RB.build.board=GENERIC_G071RB
GenG0.menu.pnum.GENERIC_G071RB.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071RB.build.variant=STM32G0xx/Generic_G071Rx

# Upload menu
GenG0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenG0.menu.upload_method.swdMethod.upload.protocol=0
GenG0.menu.upload_method.swdMethod.upload.options=-g
GenG0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenG0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenG0.menu.upload_method.serialMethod.upload.protocol=1
GenG0.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenG0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenG0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenG0.menu.upload_method.dfuMethod.upload.protocol=2
GenG0.menu.upload_method.dfuMethod.upload.options=-g
GenG0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic H7
GenH7.name=Generic STM32H7 Series

GenH7.build.core=arduino
GenH7.build.board=GenH7
GenH7.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenH7.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
GenH7.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenH7.build.series=STM32H7xx
GenH7.build.mcu=cortex-m7

# Daisy Seed board
GenH7.menu.pnum.DAISY_SEED=Daisy Seed
GenH7.menu.pnum.DAISY_SEED.upload.maximum_size=131072
GenH7.menu.pnum.DAISY_SEED.upload.maximum_data_size=524288
GenH7.menu.pnum.DAISY_SEED.build.board=DAISY_SEED
GenH7.menu.pnum.DAISY_SEED.build.product_line=STM32H750xx
GenH7.menu.pnum.DAISY_SEED.build.variant=STM32H7xx/DAISY_SEED

# Upload menu
GenH7.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenH7.menu.upload_method.swdMethod.upload.protocol=0
GenH7.menu.upload_method.swdMethod.upload.options=-g
GenH7.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenH7.menu.upload_method.serialMethod.upload.protocol=1
GenH7.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenH7.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenH7.menu.upload_method.dfuMethod.upload.protocol=2
GenH7.menu.upload_method.dfuMethod.upload.options=-g
GenH7.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic L0
GenL0.name=Generic STM32L0 series

GenL0.build.core=arduino
GenL0.build.board=GenL0
GenL0.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
GenL0.build.mcu=cortex-m0plus
GenL0.build.series=STM32L0xx
GenL0.build.cmsis_lib_gcc=arm_cortexM0l_math

# ThunderPack
GenL0.menu.pnum.THUNDERPACK_L072=ThunderPack v1.0
GenL0.menu.pnum.THUNDERPACK_L072.upload.maximum_size=196608
GenL0.menu.pnum.THUNDERPACK_L072.upload.maximum_data_size=20480
GenL0.menu.pnum.THUNDERPACK_L072.build.board=THUNDERPACK_L072
GenL0.menu.pnum.THUNDERPACK_L072.build.product_line=STM32L072xx
GenL0.menu.pnum.THUNDERPACK_L072.build.variant=STM32L0xx/THUNDERPACK

# Piconomix PX-HER0 board
GenL0.menu.pnum.PX_HER0=PX-HER0
GenL0.menu.pnum.PX_HER0.upload.maximum_size=131072
GenL0.menu.pnum.PX_HER0.upload.maximum_data_size=20480
GenL0.menu.pnum.PX_HER0.build.board=PX_HER0
GenL0.menu.pnum.PX_HER0.build.product_line=STM32L072xx
GenL0.menu.pnum.PX_HER0.build.variant=STM32L0xx/PX_HER0

# Upload menu
GenL0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL0.menu.upload_method.swdMethod.upload.protocol=0
GenL0.menu.upload_method.swdMethod.upload.options=-g
GenL0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL0.menu.upload_method.serialMethod.upload.protocol=1
GenL0.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenL0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL0.menu.upload_method.dfuMethod.upload.protocol=2
GenL0.menu.upload_method.dfuMethod.upload.options=-g
GenL0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenL0.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenL0.menu.upload_method.bmpMethod.upload.tool=bmp_upload

################################################################################
# Generic L4
GenL4.name=Generic STM32L4 series

GenL4.build.core=arduino
GenL4.build.board=GenL4
GenL4.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenL4.build.mcu=cortex-m4
GenL4.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenL4.build.series=STM32L4xx
GenL4.build.cmsis_lib_gcc=arm_cortexM4lf_math

